# Handling Categorical Data (Part-2)

## Ordinal Number Encoding

In [1]:
import datetime
today_date=datetime.datetime.today()
today_date

datetime.datetime(2021, 1, 7, 8, 50, 35, 688888)

In [2]:
today_date-datetime.timedelta(3)

datetime.datetime(2021, 1, 4, 8, 50, 35, 688888)

In [3]:
#### List Comprehension
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [5]:
days

[datetime.datetime(2021, 1, 7, 8, 50, 35, 688888),
 datetime.datetime(2021, 1, 6, 8, 50, 35, 688888),
 datetime.datetime(2021, 1, 5, 8, 50, 35, 688888),
 datetime.datetime(2021, 1, 4, 8, 50, 35, 688888),
 datetime.datetime(2021, 1, 3, 8, 50, 35, 688888),
 datetime.datetime(2021, 1, 2, 8, 50, 35, 688888),
 datetime.datetime(2021, 1, 1, 8, 50, 35, 688888),
 datetime.datetime(2020, 12, 31, 8, 50, 35, 688888),
 datetime.datetime(2020, 12, 30, 8, 50, 35, 688888),
 datetime.datetime(2020, 12, 29, 8, 50, 35, 688888),
 datetime.datetime(2020, 12, 28, 8, 50, 35, 688888),
 datetime.datetime(2020, 12, 27, 8, 50, 35, 688888),
 datetime.datetime(2020, 12, 26, 8, 50, 35, 688888),
 datetime.datetime(2020, 12, 25, 8, 50, 35, 688888),
 datetime.datetime(2020, 12, 24, 8, 50, 35, 688888)]

In [6]:
import pandas as pd
data=pd.DataFrame(days)
data.columns=["Day"]

In [7]:
data.head()

                         Day
0 2021-01-07 08:50:35.688888
1 2021-01-06 08:50:35.688888
2 2021-01-05 08:50:35.688888
3 2021-01-04 08:50:35.688888
4 2021-01-03 08:50:35.688888

In [10]:
data['weekday']=data['Day'].dt.day_name()
data.head()

                         Day    weekday
0 2021-01-07 08:50:35.688888   Thursday
1 2021-01-06 08:50:35.688888  Wednesday
2 2021-01-05 08:50:35.688888    Tuesday
3 2021-01-04 08:50:35.688888     Monday
4 2021-01-03 08:50:35.688888     Sunday

In [11]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7
    
}

In [12]:
data['weekday_ordinal']=data['weekday'].map(dictionary)

In [13]:
data

                          Day    weekday  weekday_ordinal
0  2021-01-07 08:50:35.688888   Thursday                4
1  2021-01-06 08:50:35.688888  Wednesday                3
2  2021-01-05 08:50:35.688888    Tuesday                2
3  2021-01-04 08:50:35.688888     Monday                1
4  2021-01-03 08:50:35.688888     Sunday                7
5  2021-01-02 08:50:35.688888   Saturday                6
6  2021-01-01 08:50:35.688888     Friday                5
7  2020-12-31 08:50:35.688888   Thursday                4
8  2020-12-30 08:50:35.688888  Wednesday                3
9  2020-12-29 08:50:35.688888    Tuesday                2
10 2020-12-28 08:50:35.688888     Monday                1
11 2020-12-27 08:50:35.688888     Sunday                7
12 2020-12-26 08:50:35.688888   Saturday                6
13 2020-12-25 08:50:35.688888     Friday                5
14 2020-12-24 08:50:35.688888   Thursday                4

## Count Or Frequency Encoding

In [14]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

   0                  1       2           3   ...  11  12              13      14
0  39          State-gov   77516   Bachelors  ...   0  40   United-States   <=50K
1  50   Self-emp-not-inc   83311   Bachelors  ...   0  13   United-States   <=50K
2  38            Private  215646     HS-grad  ...   0  40   United-States   <=50K
3  53            Private  234721        11th  ...   0  40   United-States   <=50K
4  28            Private  338409   Bachelors  ...   0  40            Cuba   <=50K

[5 rows x 15 columns]

In [15]:
columns=[1,3,5,6,7,8,9,13]

In [16]:
train_set=train_set[columns]

In [17]:
train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [18]:
train_set.head()

          Employment      Degree  ...      Sex         Country
0          State-gov   Bachelors  ...     Male   United-States
1   Self-emp-not-inc   Bachelors  ...     Male   United-States
2            Private     HS-grad  ...     Male   United-States
3            Private        11th  ...     Male   United-States
4            Private   Bachelors  ...   Female            Cuba

[5 rows x 8 columns]

In [19]:
for feature in train_set.columns[:]:
    print(feature,":",len(train_set[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [20]:
country_map=train_set['Country'].value_counts().to_dict()

In [21]:
train_set['Country']=train_set['Country'].map(country_map)
train_set.head(20)

           Employment         Degree  ...      Sex Country
0           State-gov      Bachelors  ...     Male   29170
1    Self-emp-not-inc      Bachelors  ...     Male   29170
2             Private        HS-grad  ...     Male   29170
3             Private           11th  ...     Male   29170
4             Private      Bachelors  ...   Female      95
5             Private        Masters  ...   Female   29170
6             Private            9th  ...   Female      81
7    Self-emp-not-inc        HS-grad  ...     Male   29170
8             Private        Masters  ...   Female   29170
9             Private      Bachelors  ...     Male   29170
10            Private   Some-college  ...     Male   29170
11          State-gov      Bachelors  ...     Male     100
12            Private      Bachelors  ...   Female   29170
13            Private     Assoc-acdm  ...     Male   29170
14            Private      Assoc-voc  ...     Male     583
15            Private        7th-8th  ...     Male     643
16   Self-emp-not-inc        HS-grad  ...     Male   29170
17            Private        HS-grad  ...     Male   29170
18            Private           11th  ...     Male   29170
19   Self-emp-not-inc        Masters  ...   Female   29170

[20 rows x 8 columns]

## Target Guided Ordinal Encoding

In [22]:
df=pd.read_csv('titanic.csv', usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [23]:
df['Cabin'].fillna('Missing',inplace=True)
df['Cabin']=df['Cabin'].astype(str).str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [24]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [25]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [26]:

ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [27]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'A': 2, 'B': 6, 'C': 4, 'D': 8, 'E': 7, 'F': 5, 'G': 3, 'M': 1, 'T': 0}

In [28]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

## Mean Encoding

In [29]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [30]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [31]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854